{"color":"BROWN","isTrashed":false,"isPinned":false,"isArchived":true,"annotations":[{"description":"This traditional Christmas Punch is the Swedish version of mulled wine. There are different variations out there including Glühwein, but this one is my favor...","source":"WEBLINK","title":"Glögg - How to Make Swedish Mulled Wine with Red Wine, Brandy \u0026 Spices","url":"https://www.youtube.com/watch?v\u003d-34Ckb9hfj4"}],"textContent":"Recipe:\n4 Cups (1 L) Red Wine (Shiraz suggested)\n1 Cup (240 ml) Brandy\n15 Blanched Almonds (with more for serving)\n0.5 Cup (120 ml) Raisins (with more for serving)\n4 Cardamom Pods\n3 Whole Cloves\n1 Cinnamon Stick\n2 Dried Apricots\n2 tbsp (15 ml) chopped Candied Orange Peel\n0.75 Cup (180 ml) Light Brown Sugar\n2 Peels of one fresh Orange\n\n\nChop the Candied Orange Peels. Crack open Cardamom Pods. Add the Cardamom, Cloves, Cinnamon, Apricots, and Candied Orange Peel to the cheesecloth. Tie it with twine.\n\nPour 1 L of Wine into a pot. Add Raisins, Almonds and the Cheesecloth. Let steep at room temperature for 8-10 hours.\n\nSlice 2 strips of fresh Orange Peel. Place peels in a bowl and cover it with Brown Sugar. And let that sit for 8-10 hours at room temperature as well.\n\n\nAfter they\u0027ve steeped. Warm up the wine on medium heat. Do not allow it to boil. Add the Orange Peel and Sugar. Stir the Sugar until it is dissolved. Remove from heat. Stir in the Brandy. Fish out the cheesecloth bag and discard it.\n\nUse a long-stem lighter to light the wine on fire. Let it burn for no more than 2 seconds before extinguishing it with the lid of the pot.\n\nTurn the heat to Low to keep the pot warm. Alternatively, you can pour the mixture into a Crockpot and set that on warm. If the Glögg will not be drank within a couple hours, remove the orange peels and discard them.\n\nTo serve it, warm the mug(s). Add a couple raisins and almonds to each mug. Ladle the Glögg into the mug directly from the pot or Crockpot.\n\nhttps://www.youtube.com/watch?v\u003d-34Ckb9hfj4","title":"Glogg (Swedish Mulled Wine)","userEditedTimestampUsec":1579219203072000,"labels":[{"name":"Drinks"},{"name":"Dry"},{"name":"Group"},{"name":"Dinner"},{"name":"Hot Drinks"}]}